# підключити бібліотеку random
import random
# отримати число
nummber = random.randint(1, 100)
# оголосити кількість спроб та лічильник
attemp = 6
count = 1
# використати безперервний цикл з перевіркою лічильника і кількості спроб
while count <= attemp:
    # відгадуємо число, методом введення в консоль
    guess_nummber = int(input("Введіть число:- ") or 0)

    # перевіряємо введене число з числом з рандомайзера

    # якщо введене число вгадане, виводимо відповідне повідомлення,кількість спроб та перериваємо цикл
    if nummber == guess_nummber:
        print("Вітаю, Ви вгадали число, використавши ", count, " спроб")
        break

    # якщо введене число більше, виводимо відповідне повідомлення і кількість спроб
    elif nummber > guess_nummber and attemp - count != 0:
        print("Введене число менше, ніж невідоме. Спробуйте, ще раз. У вас залишилось", attemp - count, "спроб")

    # якщо введене число менше, виводимо відповідне повідомлення і кількість спроб
    elif nummber < guess_nummber and attemp - count != 0:
        print("Введене число більше, ніж невідоме. Спробуйте, ще раз. У вас залишилось", attemp - count, "спроб")

    # перевіряємо чи не закінчились спроби
    if count >= attemp:
        print("Ви використали всі спроби. Хай щастить настуного разу")

    # збільшуємо лічильник
    count += 1